### DataFrame에서 행/열 삭제

In [1]:
# 모듈로딩
import pandas as pd

In [2]:
# 데이터 준비
data={'name':['홍길동', '마징가', '원더우먼'],
       'job':['의적','로봇', '영웅'],
       'gender':['남','남','여'],
       'age':[100, 200, 300],
       'height':[180,300,200]}

In [3]:
dataDF=pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

- 1번행 삭제 : 변수명.drop() 메서드 사용
    - 변수명.drop(labels, axis=0) : axis의 설정값에 따라 행 또는 열 삭제를 진행
    - 변수명.drop(index) : 지정된 인덱스의 행 삭제

In [4]:
# 한개행 삭제(원본은 유지) -> 기본값은 행삭제, 복사본
dataDF.drop(1)

   name job gender  age  height
0   홍길동  의적      남  100     180
2  원더우먼  영웅      여  300     200

In [5]:
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

In [6]:
# 두개행 삭제(원본유지)
dataDF.drop([0,2])

  name job gender  age  height
1  마징가  로봇      남  200     300

- 컬럼삭제 : 변수명.drop(기본값=0 ,axis=1 or axis='columns')메서드 axis(축지정할때)
    - 변수명.drop(labels, axis=1) : axis의 설정값에 따라 행 또는 열 삭제를 진행
    - 변수명.drop(columns) : 지정된 인덱스의 열 삭제

In [7]:
# age 컬럼을 삭제하고싶어
dataDF.drop('age', axis=1)

   name job gender  height
0   홍길동  의적      남     180
1   마징가  로봇      남     300
2  원더우먼  영웅      여     200

In [14]:
# gender, heigt 컬럼을 삭제
dataDF.drop(['gender','height'], axis=1)
dataDF.drop(dataDF.columns[3:], axis=1)
dataDF.drop(columns=dataDF.columns[3:])

   name job gender
0   홍길동  의적      남
1   마징가  로봇      남
2  원더우먼  영웅      여

: